README.md

# Table of Contents

1.  [What is this?](#orgb314aea)
2.  [Data](#org45f2614)



<a id="orgb314aea"></a>

# What is this?

This is a simple start for an image classifier. It is strongly based on the tutorial from tensor flow ([tensorflow image classification](http:https://www.tensorflow.org/lite/models/image_classification/overview)).


<a id="org45f2614"></a>

# Data

In order to reproduce this code, you need data!
The data I used, was from [kaggle food](https:https://www.kaggle.com/kmader/food41). In order to do so, create a folder in root called data.
The test made so far used only five classes of food from this data base, so to use the code to go, create a folder with the name food-5 inside the data folder.
The structure you will have, will look like this:

    data
    | 
    + -- data
    | + -- food
    | | + -- all food labels
    | + -- food-5
    | | + -- five of the food labels

